9/data/attachments/de6de5a82b6f3a7c.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_cc45c340-44e2-4cca-b933-4a428ae8bc28</nif:username>
            <nif:friendToBeAdded>Matthew_coach_Friend_7911_4</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>